{"GordonRamsay": {"password": "hellkitchen", "recipes": [{"descriptions": "Deskripsideskripsi", "food_name": "Bao Breakfast Ramsay Style", "ingredients": ["Dough", "1/2 cup (113g) milk, whole preferred; lukewarm", "3 tablespoons (37g) granulated sugar", "1 1/2 teaspoons vegetable oil, plus more for shaping", "1/2 teaspoon instant yeast", "1/4 teaspoon baking powder", "1/4 teaspoon table salt", "4 large eggs, at room temperature", "2 tablespoons (14g) scallions, thinly sliced", "4 teaspoons mirin", "4 teaspoons Shaoxing rice wine, sherry, or sake*", "4 teaspoons water, cool", "2 teaspoons toasted sesame oil", "1/8 teaspoon table salt", "1/8 teaspoon white pepper, ground", "2 to 4 teaspoons vegetable oil, for cooking", "soy paste, for drizzling", ""], "instructions": ["To make the bao dough: In the bowl of a stand mixer fitted with a dough hook, combine all the dough ingredients. Knead until a smooth, tacky dough forms, about 8 to 10 minutes.", "Transfer the dough to a lightly greased bowl, cover, and let it rise at room temperature until nearly doubled in bulk, 60 to 90 minutes.", "Meanwhile, cut out eight 3 1/2\" x 3 1/2\" parchment squares.", "Turn the bao dough out onto a lightly greased surface. Gently deflate the dough and divide it into 8 even pieces (about 41g each).", "Shape each piece into a tight ball: Pull the edges into the center, place seam side down on your work surface, then cup your hand over the dough ball and move in a circular motion to tighten the surface tension of the dough. Repeat with each piece of dough.", "Starting with the first dough ball, use a wooden dowel or small tapered rolling pin to flatten the dough into an oval shape, seam-side down. The dough will retract at this point, which is OK. Set aside and repeat with the other pieces of dough.", "Returning to the first piece of dough, roll it again so that it forms a rough 3\" x 6\" oval. Repeat with the other pieces of dough. You may need to repeat this process 2 or 3 times before the dough stays this size, with brief rests between rolling attempts. To achieve thin edges, rotate the dough with your non-dominant hand gradually as you roll out the edges of the oval using a pin in your dominant hand.", "Flip the dough over (so it's now seam-side up), brush with a thin layer of oil, then fold in half like a clamshell. Place the folded dough onto one of the parchment squares on a baking sheet. Repeat with the remaining dough.", "Loosely cover the baking sheet with plastic wrap or a reusable cover, and let the dough rise in a warm place for 30 to 45 minutes. The gua bao will not rise significantly but should become puffier.", "To steam the gua bao: Bring a shallow pot or frying pan of water to a boil. Place the gua bao with their individual parchment squares onto the steamer trays. Place the steamer trays and lid on top of the pot (or pan) and steam for 10 minutes. Remove the steamer basket from the water and let the buns rest inside, still covered, for 10 additional minutes. The steamed gua bao will be firm and bounce back when poked. (If your steamer trays cannot fit all the bao, you may have to steam in batches.)", "To make the omelets: While the gua bao are resting, whisk together all of the omelet ingredients except for the oil. Add 1 teaspoon of oil to a small (6\" or 8\" diameter) nonstick pan and heat over medium to medium-low until the oil shimmers. Pour in enough of the egg mixture to coat the bottom of the pan in a thin layer. Lower the heat to prevent any sizzling, if necessary. Cook the egg mixture undisturbed until the bottom is set, 1 to 2 minutes depending on the pan size. While the top is still slightly wet, fold the omelet over onto itself 2 or more times to create a roughly 2\"-wide strip across the diameter of the pan. (If cooking in a 6\" nonstick pan, these omelets easily fold into thirds. If using a larger pan, you may need to make more folds.)", "Transfer the cooked omelet to a cutting board and repeat with the rest of the egg mixture until it's all used. Once all the omelets are cooked, slice them crosswise into roughly 3\" pieces for filling the gua bao.", "To assemble the breakfast bao: Fill each gua bao with a portion of omelet, then drizzle on soy paste to taste. Add about 1 tablespoon of pork floss per bun. Eat warm or at room temperature.", "Storage information: Store steamed, unfilled buns in an airtight container in the refrigerator for 2 to 3 days or freeze for 1 month. Reheat in the microwave, covered with a damp paper towel so that they don’t dry out."]}], "username": "GordonRamsay"}, "NickDiGiovanni": {"password": "NickDiGiovanni", "recipes": [{"descriptions": "If you haven't yet discovered the pan pizza, stop what you're doing right now. You NEED it in your life. The pan pizza is not like the others. In fact, I'd argue that, if properly executed, it has the best elements from every pizza out there. On one hand, you have the cheesy deliciousness you'd look for in any pizza. On the crust, you've got deep caramelization from the sugars in the tomato sauce and the cheese near the edges. And, of course, the dough (depending on what you use) provides a fantastic flavor and chewiness.", "food_name": "Cast Iron Pan Pizza", "ingredients": ["1100 grams (7 1/2c) bread flour ", "38 grams (4 tsp) fine sea salt ", "2 gram (1/2 tsp) active dry yeast ", "780 grams or 3 1/4 cups of water", "2 cups low moisture mozzarella (shredded)", "1 can crushed whole tomatoes", "5-6 leaves of basil", "2 tsp Osmo white flakey salt", "2 cups low moisture mozzarella (shredded)"], "instructions": ["In a large bowl, whisk together the bread flour, salt, and yeast. Slowly add the water, and mix with a wooden spoon just to combine.", "Once the mixture is moistened, lightly flour a countertop or large cutting board and remove the dough from the bowl with lightly oiled or wet hands (to discourage sticking). Knead for 2-3 minutes to remove clumps and form into a dough ball.", "Place the dough in a lightly oiled bowl and cover with a damp kitchen towel. Place on counter and let sit 24 hours at room temperature.", "Lightly flour a large cutting board or your kitchen countertop, and place the dough on it. Wet or lightly oil your hands again.", "Divide dough into seven equal portions and make your dough balls. Place the dough balls into oiled cylindrical airtight containers (deli takeaway containers are ideal), date the containers, and place in the fridge for 48 to 96 hours.", "Remove from refrigerator at least 1 hour before use to allow the dough to come to room temperature; this lets the gluten relax and makes the dough malleable.", "Roll basil into a tight log and slice thinly. Mix together sliced basil, tomatoes, and salt.", "Spread your dough around the bottom of a cast iron pan.", "Lightly spread on your tomato sauce and place some along the edges to caramelize.", "Top with cheese, including along all the edges to crisp up.", "Bake at 450°F until golden brown and caramelized on top.", "To remove, slide a butter knife along the inner side of the pan to keep as much of the browned crust off the pan. Then slide out onto a cutting board, slice, and enjoy the crispiness!"]}, {"food_name": "Wagyu Katsu Sando", "descriptions": "After so many requests, I made Japan's most famous sandwich: The Wagyu Katsu Sando. This is often called the most expensive sandwich in the world, and for good reason. It can cost up to $200 dollars for just a small sandwich in restaurants, but it's so simple to make. And, if you choose to make this, you can't forget about the sweet, umami katsu sauce to go with it. All I could think about when eating this sandwich was \"butter.\" Yum.", "ingredients": ["1 cup water", "1 cup whole milk", "2/3 cup bread flour", "5 cups bread flour", "1/2 cup granulated sugar", "2 packets active dry yeast (2 tsp)", "Salt to taste", "1 cup warm milk", "2 eggs (one-handed egg crack, please)", "1 stick (8 tbsp) cubed butter", "1/2 tbsp soy sauce", "", "1/2 tbsp oyster sauce", "3 tbsp Worcestershire sauce", "1 tbsp honey", "3 tbsp ketchup", "Wagyu beef squares", "1 cup panko bread crumbs", "1 egg", "1 cup all purpose flour"], "instructions": ["To a small saucepan add water and milk, and slowly whisk in 2/3 cup of bread flour.", "Continue whisking on medium high heat for about 5 minutes until thickened but pourable.", "Set aside and let cool to room temperature.", "To a stand mixer with a dough hook attachment, add 5 cups of bread flour, sugar, yeast, a pinch of salt, and mix on medium.", "Slowly add in milk, eggs, and about 1 cup of our tangzhong mixture.", "After kneading for 5 minutes, slowly add cubed butter and continue kneading until the butter is incorporated.", "Oil your hands before removing the dough and shaping into a ball, then place into a greased bowl and cover with a damp paper towel in a warm place for an hour.", "Flour your hands and workspace and dump out your dough.", "Cut into thirds and shape into a log before placing into a rectangular bread pan.", "Cover and let rise for 30 more minutes.", "Uncover and brush with whole milk before baking at 350°F for 35-40 minutes.", "In a bowl mix soy sauce, oyster sauce, Worcestershire sauce, honey, and ketchup together.", "Cut wagyu into a square.", "Season with salt, then dredge lightly in flour, egg wash, and then panko.", "Deep fry at 400°F until golden brown.", "Cut bread into square slices and toast on one side in a pan with wagyu fat.", "Brush the toasted side with our sauce.", "Assemble the sandwich with the fried wagyu piece, slice in half, and enjoy!"]}], "username": "NickDiGiovanni"}}