{"GordonRamsay": {"password": "hellkitchen", "recipes": [{"descriptions": "", "food_name": "Bao Breakfast", "ingredients": ["Dough", "1/2 cup (113g) milk, whole preferred; lukewarm", "3 tablespoons (37g) granulated sugar", "1 1/2 teaspoons vegetable oil, plus more for shaping", "1/2 teaspoon instant yeast", "1/4 teaspoon baking powder", "1/4 teaspoon table salt", "4 large eggs, at room temperature", "2 tablespoons (14g) scallions, thinly sliced", "4 teaspoons mirin", "4 teaspoons Shaoxing rice wine, sherry, or sake*", "4 teaspoons water, cool", "2 teaspoons toasted sesame oil", "1/8 teaspoon table salt", "1/8 teaspoon white pepper, ground", "2 to 4 teaspoons vegetable oil, for cooking", "soy paste, for drizzling", ""], "instructions": ["To make the bao dough: In the bowl of a stand mixer fitted with a dough hook, combine all the dough ingredients. Knead until a smooth, tacky dough forms, about 8 to 10 minutes.", "Transfer the dough to a lightly greased bowl, cover, and let it rise at room temperature until nearly doubled in bulk, 60 to 90 minutes.", "Meanwhile, cut out eight 3 1/2\" x 3 1/2\" parchment squares.", "Turn the bao dough out onto a lightly greased surface. Gently deflate the dough and divide it into 8 even pieces (about 41g each).", "Shape each piece into a tight ball: Pull the edges into the center, place seam side down on your work surface, then cup your hand over the dough ball and move in a circular motion to tighten the surface tension of the dough. Repeat with each piece of dough.", "Starting with the first dough ball, use a wooden dowel or small tapered rolling pin to flatten the dough into an oval shape, seam-side down. The dough will retract at this point, which is OK. Set aside and repeat with the other pieces of dough.", "Returning to the first piece of dough, roll it again so that it forms a rough 3\" x 6\" oval. Repeat with the other pieces of dough. You may need to repeat this process 2 or 3 times before the dough stays this size, with brief rests between rolling attempts. To achieve thin edges, rotate the dough with your non-dominant hand gradually as you roll out the edges of the oval using a pin in your dominant hand.", "Flip the dough over (so it's now seam-side up), brush with a thin layer of oil, then fold in half like a clamshell. Place the folded dough onto one of the parchment squares on a baking sheet. Repeat with the remaining dough.", "Loosely cover the baking sheet with plastic wrap or a reusable cover, and let the dough rise in a warm place for 30 to 45 minutes. The gua bao will not rise significantly but should become puffier.", "To steam the gua bao: Bring a shallow pot or frying pan of water to a boil. Place the gua bao with their individual parchment squares onto the steamer trays. Place the steamer trays and lid on top of the pot (or pan) and steam for 10 minutes. Remove the steamer basket from the water and let the buns rest inside, still covered, for 10 additional minutes. The steamed gua bao will be firm and bounce back when poked. (If your steamer trays cannot fit all the bao, you may have to steam in batches.)", "To make the omelets: While the gua bao are resting, whisk together all of the omelet ingredients except for the oil. Add 1 teaspoon of oil to a small (6\" or 8\" diameter) nonstick pan and heat over medium to medium-low until the oil shimmers. Pour in enough of the egg mixture to coat the bottom of the pan in a thin layer. Lower the heat to prevent any sizzling, if necessary. Cook the egg mixture undisturbed until the bottom is set, 1 to 2 minutes depending on the pan size. While the top is still slightly wet, fold the omelet over onto itself 2 or more times to create a roughly 2\"-wide strip across the diameter of the pan. (If cooking in a 6\" nonstick pan, these omelets easily fold into thirds. If using a larger pan, you may need to make more folds.)", "Transfer the cooked omelet to a cutting board and repeat with the rest of the egg mixture until it's all used. Once all the omelets are cooked, slice them crosswise into roughly 3\" pieces for filling the gua bao.", "To assemble the breakfast bao: Fill each gua bao with a portion of omelet, then drizzle on soy paste to taste. Add about 1 tablespoon of pork floss per bun. Eat warm or at room temperature.", "Storage information: Store steamed, unfilled buns in an airtight container in the refrigerator for 2 to 3 days or freeze for 1 month. Reheat in the microwave, covered with a damp paper towel so that they don’t dry out."]}, {"food_name": "Bakpao", "descriptions": "THIS IS NEWER DESCRIPTION FUIYOH", "ingredients": ["Tepung", "Telur", "Coklat"], "instructions": ["this is first instructions"]}], "username": "GordonRamsay"}, "NickDiGiovanni": {"password": "NickDiGiovanni", "recipes": [], "username": "NickDiGiovanni"}}